Repository: yshialexandra/Optimizing_LLM_Chinese_Translation_through_Syntactic_Feature_Extraction_and_Representation_Editing
Catalog: yshibachlorpaper/Yiyan_tmx/G13.tmx
Source language: en_us
Languages: zh_cn

source: William Alexander Morgan in the Cuban Revolution
zh_cn: 古巴革命中的美国佬指挥官

source: William Alexander Morgan being applauded by Fidel Castro, in Havana in 1959.
zh_cn: 1959年，哈瓦那，威廉亚历山大摩根得到费德罗卡斯特罗的欢迎。

source: Morgan said that he had joined the Cuban Revolution because "the most important thing for free men to do is to protect the freedom of others."
zh_cn: 摩根说，他参加古巴革命的原因是“对于一个自由人来说，最伟大的事就是捍卫他人的自由。”

source: For a moment, he was obscured by the Havana night. It was as if he were invisible, as he had been before coming to Cuba, in the midst of revolution.
zh_cn: 他一度隐身于哈瓦那的夜晚，默默无闻，即如他来到正处在革命浪潮中的古巴之前那样。

source: Then a burst of floodlights illuminated him: William Alexander Morgan, the great Yankeecomandante.
zh_cn: 然后在顷刻间，强光灯打在他的身上：威廉亚历山大摩根，这位伟大的美国佬指挥官成为世人关注的焦点。

source: He was standing, with his back against a bullet-pocked wall, in an empty moat surrounding La Caba?a--an eighteenth-century stone fortress, on a cliff overlooking Havana Harbor, that had been converted into a prison.
zh_cn: 他站在卡巴尼亚堡（La Cabana，或称“圣卡洛斯要塞”）的护城河里，背靠布满弹孔的墙壁。这个堡垒始建于18世纪，居于俯瞰哈瓦那港口的峭壁上，如今被改造成了监狱。

source: Flecks of blood were drying on the patch of ground where Morgan's friend had been shot, moments earlier.
zh_cn: 就在刚才，摩根的朋友被枪杀，地上留下斑斑渐干的血迹。

source: Morgan, who was thirty-two, blinked into the lights. He faced a firing squad.The gunmen gazed at the man they had been ordered to kill.
zh_cn: 摩根在强光照射下眨着眼，他面前的行刑队，瞄准他，准备射击。

source: Morgan was nearly six feet tall, and had the powerful arms and legs of someone who had survived in the wild.
zh_cn: 摩根32岁，身高近6英尺，身体强壮。

source: With a stark jaw, a pugnacious nose, and scruffy blond hair, he had the gallant look of an adventurer in a movie serial, of a throwback to an earlier age, and photographs of him had appeared in newspapers and magazines around the world.
zh_cn: 他下巴突出、鼻子尖挺，一头乱糟糟的金发，看上去像是电影里表现的早期探险家。世界各地的人们从报刊和杂志上登载的照片认识了他。

source: The most alluring images--taken when he was fighting in the mountains, with Fidel Castro and Che Guevara--showed Morgan, with an untamed beard, holding a Thompson submachine gun.
zh_cn: 其中最吸引人的形象便是他在山里与卡斯特罗和切格瓦拉并肩战斗时拍下，他满脸恣意生长的络腮胡子，端着汤普森冲锋枪。

source: Though he was now shaved and wearing prison garb, the executioners recognized him as the mysteriousAmericanowho once had been hailed as a hero of the revolution.
zh_cn: 虽然他已刮掉胡子，身穿囚服，行刑者仍然能够认出他，这个神秘的美国佬，曾被当作革命英雄受到万众欢呼。

source: It was March 11, 1961, two years after Morgan had helped to overthrow the dictator Fulgencio Batista, bringing Castro to power.
zh_cn: 时间定格在1961年3月11日，也就是摩根帮助推翻了古巴独裁者富尔亨西奥·巴蒂斯塔，卡斯特罗掌权仅仅两年。

source: The revolution had since fractured, its leaders devouring their own, like Saturn, but the sight of Morgan before a firing squad was a shock.
zh_cn: 此后，革命变了样，领导人们开始自相残杀，但摩根站在行刑队面前这个场景还是令人震惊。

source: In 1957, when Castro was still widely seen as fighting for democracy, Morgan had travelled from Florida to Cuba and headed into the jungle, joining a guerrilla force.
zh_cn: 1957年，卡斯特罗仍被广泛视为在为民主而战，摩根从佛罗里达来到古巴，进入丛林，加入了游击队。

source: In the words of one observer, Morgan was "like Holden Caulfield with a machine gun."
zh_cn: 当时有人说他是“端着冲锋枪的霍尔顿·考尔菲德。”

source: He was the only American in the rebel army and the sole foreigner, other than Guevara, an Argentine, to rise to the army's highest rank,comandante.
zh_cn: 他是唯一成为叛军高级指挥官的美国人，也是除了阿根廷人格瓦拉之外的唯一外国人。

source: After the revolution, Morgan's role in Cuba aroused even greater fascination, as the island became enmeshed in the larger battle of the Cold War.
zh_cn: 革命成功之后，随着这个岛国被深深地卷入更大规模的冷战，摩根在古巴的角色更是让人遐想。

source: An American who knew Morgan said that he had served as Castro's "chief cloak-and-dagger man," andTimecalled him Castro's "crafty, U.S.-born double agent."
zh_cn: 了解摩根的一名美国人称他是卡斯特罗的“首席间谍”，《时代》周刊则直呼他为卡斯特罗手下的“出生于美国的狡诈的双料间谍。”

source: Now Morgan was charged with conspiring to overthrow Castro.
zh_cn: 如今摩根被控阴谋推翻卡斯特罗。

source: The Cuban government claimed that Morgan had actually been working for U.S. intelligence--that he was, in effect, a triple agent.
zh_cn: 古巴政府宣称，摩根实际上为美国情报部门工作，这样，他就成了三重间谍。

source: Morgan denied the allegations, but even some of his friends wondered who he really was, and why he had come to Cuba.
zh_cn: 摩根否认全部指控，但即使是他的朋友，也始终不明白他到底是什么人，为何来古巴。

source: Before Morgan was led outside La Caba?a, an inmate asked him if there was anything he could do for him. Morgan replied, "If you ever get out of here alive, which I doubt you will, try to tell people my story."
zh_cn: 摩根被带到卡巴尼亚堡之前，他的狱友问能为他做什么时，摩根说：“如果你能活着出去，不过我很怀疑，那就把我的故事告诉世人。”

source: Morgan grasped that more than his life was at stake: the Cuban regime would distort his role in the revolution, if not excise it from the public record, and the U.S. government would stash documents about him in classified files, or "sanitize" them by concealing passages with black ink.
zh_cn: 摩根明白，他失去的不仅是他的生命：古巴当局即便不会让他从官方记录中抹去，也会歪曲他在革命中的作用，而美国政府也会将涉及他的档案打上机密字样束之高阁，或者用黑墨汁涂掉关键段落，给他“消毒”。

source: He would be rubbed out--first from the present, then from the past.
zh_cn: 他将被抹去，先是当前，然后是过去。

source: The head of the firing squad shouted, "Attention!"
zh_cn: 行刑队指挥官大喊：“预备！”

source: Morgan feared for his wife, Olga--whom he had met in the mountains--and for their two young daughters.
zh_cn: 摩根此时只担心他妻子，奥尔加和两个小女儿。

source: He had always managed to bend the forces of history, and he had made a last-minute plea to communicate with Castro.
zh_cn: 他总想扭转历史的发展轨迹，他在最后时刻还要求与卡斯特罗联系。

source: Morgan had believed that the man he once called his "faithful friend" would never kill him.
zh_cn: 摩根深信，这个人以前称他为“忠实的朋友”，不会杀他。

source: But now the executioners were cocking their guns.
zh_cn: 但现在，行刑队正举枪对着他。

source: THE FIRST TRICK
zh_cn: 一、牛刀初试，潜入古巴

source: When Morgan arrived in Havana, in December, 1957, he was propelled by the thrill of a secret.
zh_cn: 1957年12月，摩根抵达哈瓦那的时候，他内心激荡着秘密的刺激。

source: He made sure that he wasn't being followed as he moved surreptitiously through the neon-lit capital.
zh_cn: 在他潜行于霓虹闪烁的首都时，时刻警惕着不被人跟踪。

source: Advertised as the "Playland of the Americas," Havana offered one temptation after another: the Sans Souci night club, where, on outdoor stages, dancers with frank hips swayed under the stars to the cha-cha; the Hotel Capri, whose slot machines spat out American silver dollars; and the Tropicana, where guests such as Elizabeth Taylor and Marlon Brando enjoyed lavish revues featuring the Diosas de Carne, or "flesh goddesses."
zh_cn: 哈瓦那的广告语是“美洲的乐园，”这里有太多的诱惑：无忧宫夜总会室外舞台上表演着恰恰舞；卡普里酒店里的老虎机，吐出美国银币；热带俱乐部有富丽堂皇的滑稽剧，伊丽莎白泰勒和马龙白兰度曾在此消磨时光。

source: Morgan, then a pudgy twenty-nine-year-old, tried to appear as just another man of leisure.
zh_cn: 时年29岁的摩根，尽量装出一副来此消遣的摸样。

source: He wore a two-hundred-and-fifty-dollar white suit with a white shirt, and a new pair of shoes.
zh_cn: 他一身白西装、白衬衫和一双新皮鞋。

source: "I looked like a real fat-cat tourist," he later joked.
zh_cn: 他后来自嘲说：“我就像个来此旅游的富豪。”

source: But, according to members of Morgan's inner circle, and to the unpublished account of a close friend, he avoided the glare of the city's night life, making his way along a street in Old Havana, near a wharf that offered a view of La Caba?a, with its drawbridge and moss-covered walls. Morgan paused by a telephone booth, where he encountered a Cuban contact named Roger Rodriguez.
zh_cn: 但据他朋友们说，他没有流连于哈瓦那的夜生活，而是避开喧闹的人群，沿着哈瓦那老城区一条街来到能看到卡巴尼亚堡的码头，他停在一个电话亭边，与古巴的联络人罗杰罗德里格斯见面。

source: A raven-haired student radical with a thick mustache, Rodriguez had once been shot by police during a political demonstration, and he was a member of a revolutionary cell.
zh_cn: 他是个学生，是革命小组的成员。

source: Most tourists remained oblivious of the many iniquities of Cuba, where people often lived without electricity or running water. Graham Greene, who published "Our Man in Havana" in 1958, later recalled, "I enjoyed the louche atmosphere of Batista's city and I never stayed long enough to become aware of the sad political background of arbitrary imprisonment and torture."
zh_cn: 当时的多数旅游者都不会留意，巴蒂斯塔统治下的古巴人民，生活艰难，遭受着种种社会不公和罪恶之苦，比如随意抓人并施以酷刑。

source: Morgan, however, had briefed himself on Batista, who had seized power in a coup, in 1952: how the dictator liked sitting in his palace, eating sumptuous meals and watching horror films, and how he tortured and killed dissidents, whose bodies were sometimes dumped in fields, with their eyes gouged out or their crushed testicles stuffed in their mouths.
zh_cn: 但摩根来之前已对巴蒂斯塔有所了解。他于1952年通过政变上台，喜欢坐在宫殿里，享用着山珍海味，看恐怖片；他酷刑折磨并杀害异见者，有时会将他们的尸体弃之荒野，眼睛被挖出，嘴里塞着打碎的睾丸。

source: Morgan and Rodriguez resumed walking through Old Havana, and began a furtive conversation.
zh_cn: 摩根和罗德里格斯穿行在老城区，低声交谈。

source: Morgan was rarely without a cigarette, and typically communicated through a haze of smoke. He didn't know Spanish, but Rodriguez spoke broken English.
zh_cn: 摩根一根接一根地吸烟，他不懂西班牙语，但罗德里格斯勉强能说英语。

source: They had previously met in Miami, becoming friends, and Morgan believed that he could trust him. Morgan confided that he planned to sneak into the Sierra Maestra, a mountain range on Cuba's remote southeastern coast, where revolutionaries had taken up arms against the regime. He intended to enlist with the rebels, who were commanded by Fidel Castro.
zh_cn: 他们此前在迈阿密相识，成了朋友。摩根觉着他值得信任，就告诉他自己想潜入古巴东南部的马埃斯特拉山脉，加入那里的革命军，也就是卡斯特罗领导的队伍。

source: The name of Batista's mortal enemy carried the jolt of the forbidden.
zh_cn: 卡斯特罗是巴蒂斯塔的死敌，无人敢在公开场合提及他的名字。

source: On November 25, 1956, Castro, a thirty-year-old lawyer and the illegitimate son of a prosperous landowner, had launched from Mexico an amphibious invasion of Cuba, along with eighty-one self-styled commandos, including Che Guevara.
zh_cn: 1956年11月25日，30岁的卡斯特罗率领81名敢死队员从墨西哥出发渡海杀入古巴。

source: After their battered wooden ship ran aground, Castro and his men waded through chest-deep waters, and came ashore in a swamp whose tangled vegetation tore their skin.
zh_cn: 当他们乘坐的破木船搁浅后，他和队员们涉过齐胸深的海水，进入杂草密布的沼泽地。

source: Batista's Army soon ambushed them, and Guevara was shot in the neck.
zh_cn: 他们登陆不久，便遭到政府军伏击，敢死队员之一切格瓦拉脖子中弹。

source: (He later wrote, "I immediately began to wonder what would be the best way to die, now that all seemed lost.") Only a dozen or so rebels, including the wounded Guevara and Castro's younger brother, Raul, escaped, and, exhausted and delirious with thirst--one drank his own urine--they fled into the steep jungles of the Sierra Maestra.
zh_cn: 他后来写道：“我当即开始琢磨既然大势已去，哪种死法更好。”只有十几个叛乱分子侥幸逃脱，其中包括受伤的格瓦拉和卡斯特罗的弟弟劳尔，狼狈不堪地逃入马埃斯特拉山的密林中。

source: After Batista mistakenly declared that Castro had died in the ambush, Castro allowed aTimescorrespondent, Herbert Matthews, to be escorted into the Sierra Maestra.
zh_cn: 巴蒂斯塔误以为卡斯特罗死于那次伏击，在他对外公布了这个消息之后，卡斯特罗准许赫伯特马修斯进入叛军在密林中的营地。

source: A close friend of Ernest Hemingway, Matthews longed not merely to cover world-changing events but to make them, and he was captivated by the tall rebel leader, with his wild beard and burning cigar.
zh_cn: 马修斯是《泰晤士报》记者，海明威的密友，他不单要报道改变世界的事件，还要制造这种事件。马修斯被这个身材高大、满脸络腮胡子、抽雪茄的叛军领导人彻底迷住了。

source: "The personality of the man is overpowering," Matthews wrote.
zh_cn: 他写道：“这个人具有令人倾倒的人格魅力。

source: "Here was an educated, dedicated fanatic, a man of ideals, of courage."
zh_cn: 他受过良好的教育，拥有狂热的献身精神，是个充满理想和勇气的人。”

source: Matthews concluded that Castro had "strong ideas of liberty, democracy, social justice, the need to restore the Constitution."
zh_cn: 马修斯的结论是，卡斯特罗对于“自由、民主、社会公正和恢复宪法具有强烈的信念。”

source: On February 24, 1957, the story appeared on the paper's front page, intensifying the rebellion's romantic aura.
zh_cn: 1957年2月24日，《泰晤士报》头版刊出了这条报道，在叛乱者的浪漫光环上又抹上了浓重的一笔。

source: Matthews later put it this way: "A bell tolled in the jungles of the Sierra Maestra."
zh_cn: 马修斯后来这样写道：“钟声从马埃斯特拉丛林中响起。”

source: Yet why would an American be willing to die for Cuba's revolution?
zh_cn: 然而，为何一个美国人会愿意为古巴革命赴死？

source: When Rodriguez pressed Morgan, he indicated that he wanted to be both on the side of good and on the edge of danger, but he also wanted something else: revenge.
zh_cn: 在罗德里格斯的追问下，摩根解释说，他不仅要助人为乐，并勇于冒险，而且还要复仇。

source: Morgan said that he had an American buddy who had travelled to Havana and been killed by Batista's soldiers.
zh_cn: 他有个好朋友曾来哈瓦那旅游，但被巴蒂斯塔的士兵打死了。

source: Later, Morgan provided more details to others in Cuba: his friend, a man named Jack Turner, had been caught smuggling weapons to the rebels, and was "tortured and tossed to the sharks by Batista."
zh_cn: 他后来又向他人透露了更多细节：他那位朋友偷运武器给叛军，被抓后备受折磨，最终被巴蒂斯塔喂了鲨鱼。

source: Morgan told Rodriguez that he had already made contact with another revolutionary, who had arranged to sneak him into the mountains.
zh_cn: 摩根告诉罗德里格斯，他已经跟另一个革命者取得联系，会安排他潜入山区。

source: Rodriguez was taken aback: the supposed rebel was an agent of Batista's secret police. Rodriguez warned Morgan that he'd fallen into a trap.
zh_cn: 罗德里格斯吃了一惊：那个所谓的革命者其实是巴蒂斯塔秘密警察的特工，他摩根这可能是个圈套。

source: Rodriguez, fearing for Morgan's life, offered to help him. He could not transport Morgan to the Sierra Maestra, but he could take him to the camp of a rebel group in the Escambray Mountains, which cut across the central part of the country. These guerrillas were opening a new front, and Castro welcomed them to the "common struggle."
zh_cn: 出于对摩根安全的考虑，罗德里格斯提出帮他，虽不能带他到马埃斯特拉山区，但可以去中部的埃斯坎布雷山区，那里有被称为“第二阵线”的反叛队伍。卡斯特罗欢迎他们加入“共同的斗争。”

source: Morgan set out with Rodriguez and a driver on the two-hundred-and-seventeen mile journey.
zh_cn: 就这样，摩根、罗德里格斯和一位司机开始了他们270英里的冒险之旅。

source: As Aran Shetterly details in his incisive biography "The Americano" (2007), the car soon arrived at a military roadblock.
zh_cn: 据阿然舍特利在《这个美国佬》传记中描述，他们开车上路不久便遇到一个军队哨卡。

source: A soldier peered inside at Morgan in his gleaming suit, the only outfit that he seemed to own.
zh_cn: 有个士兵向里张望，审视着穿着光鲜西装，但再无其它行装的摩根。

source: Morgan knew what would happen if he were seized--as Guevara said, "in a revolution, one wins or dies"--and he had prepared a cover story, in which he was an American businessman on his way to see coffee plantations.
zh_cn: 摩根深知一旦被抓将会是何等下场，他编造说自己是个美国商人，正赶去咖啡园的路上。

source: After hearing the tale, the soldier let them pass, and Morgan and his conspirators roared up the road, up into the Escambray, where the air became cooler and thinner, and where the three-thousand-foot peaks had an eerie purple tint.
zh_cn: 士兵听了这个故事，就放行了。他们加速前行，进入山区，这里的空气清凉、稀薄，海拔3000英尺的山峰呈现出怪异的紫色。

source: Morgan was taken to a safe house to rest, then driven to a mountainside near the town of Banao.
zh_cn: 摩根被带到安全屋休息，然后又乘车到了半山腰。

source: A peasant shepherded Morgan and Rodriguez through vines and banana leaves until they reached a remote clearing, flanked by steep slopes.
zh_cn: 一位农民带着他们穿过茂密的葡萄园和香蕉园，终于进入四面是陡峭山坡的一片空地。

source: The peasant made a birdlike sound, which rang through the forest and was reciprocated by a distant whistle.
zh_cn: 那个农民发出像鸟叫的声响并得到了远处的回应。

source: A sentry emerged, and Morgan and Rodriguez were led to a campsite strewn with water basins and hammocks and a few antiquated rifles.
zh_cn: 然后走过来一个哨兵，带着他们进入散布者洗脸盆、吊床和步枪的一处营地。

source: Morgan could count only thirty or so men, many of whom appeared barely out of high school and had the emaciated, straggly look of shipwreck survivors.
zh_cn: 这里有大约30个人，多数看起来连高中都没上完，面容憔悴，像是船翻后的幸存者凌乱。

source: The rebels regarded Morgan uncertainly.
zh_cn: 叛军满腹狐疑地看待摩根。

source: Max Lesnik, a Cuban journalist in charge of the organization's propaganda, soon met up with the group, and recalls wondering if Morgan was "some kind of agent from the C.I.A."
zh_cn: 当时负责该组织宣传工作的古巴记者马克斯莱兹尼克不久来到这个营地，他当时就说摩根是“中情局派来的人。”

source: Since the Spanish-American War, the U.S. had often meddled in Cuban affairs, treating the island like a colony.
zh_cn: 自从1898年美西战争之后，美国常常卷入古巴事务，将这个岛国视为自己的殖民地。

source: President Dwight D. Eisenhower had blindly supported Batista--believing that he would "deal with the Commies," as he put it to Vice-President Richard Nixon--and the C.I.A. had activated operatives throughout the island.
zh_cn: 美国总统德怀特艾森豪威尔曾盲目地支持巴蒂斯塔，认为他能“对付共产主义信徒。”中央情报局（以下简称“CIA”）特工在这个岛国到处活动。

source: In 1954, in a classified report, an American general advised that if the U.S. was to survive the Cold War it needed to "learn to subvert, sabotage, and destroy our enemies by more clever, more sophisticated, and more effective methods than those used against us."
zh_cn: 在1954年的一份机密报告中，有位美国将军曾建议，如果美国想要赢得冷战的胜利，就需要“学会更聪明、更高级和更有效的方法，颠覆、破坏和摧毁用此手段对付我们的敌人。”

source: As the C.I.A. tried to assess the threat to Batista, its operatives attempted to penetrate rebel forces in the mountains. Among other things, agents were believed to have recruited, or posed as, reporters.
zh_cn: 为了评估巴蒂斯塔面临的威胁，中情局特工设法打入叛军队伍，方式之一就是假扮成记者。
